<a href="https://colab.research.google.com/github/siddharthchd/Applied_Data_Science_with_Python/blob/main/Introduction_to_Data_Science_in_Python/week3/mergingDf.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

staff_df = pd.DataFrame([{'Name' : 'Kelly', 'Role' : 'Director of HR'},
                         {'Name' : 'Sally', 'Role' : 'Course liason'},
                         {'Name' : 'James', 'Role' : 'Grader'}])
staff_df = staff_df.set_index('Name')

student_df = pd.DataFrame([{'Name' : 'James', 'School' : 'Business'},
                           {'Name' : 'Mike', 'School' : 'Law'},
                           {'Name' : 'Sally', 'School' : 'Engineering'}])
student_df = student_df.set_index('Name')

print(staff_df.head())
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally   Course liason
James          Grader
            School
Name
James     Business
Mike           Law
Sally  Engineering

In [2]:
pd.merge(staff_df, student_df, how = 'outer', left_index = True, right_index = True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally   Course liason  Engineering

In [3]:
pd.merge(staff_df, student_df, how = 'inner', left_index = True, right_index = True)

                Role       School
Name
Sally  Course liason  Engineering
James         Grader     Business

In [4]:
pd.merge(staff_df, student_df, how = 'left', left_index = True, right_index = True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally   Course liason  Engineering
James          Grader     Business

In [5]:
pd.merge(staff_df, student_df, how = 'right', left_index = True, right_index = True)

                Role       School
Name
James         Grader     Business
Mike             NaN          Law
Sally  Course liason  Engineering

In [6]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()

pd.merge(staff_df, student_df, how = 'right', on = 'Name')

    Name           Role       School
0  James         Grader     Business
1   Mike            NaN          Law
2  Sally  Course liason  Engineering

In [9]:
 staff_df = pd.DataFrame([{'Name' : 'Kelly', 'Role' : 'Director of HR', 'Location' : 'State Street'},
                         {'Name' : 'Sally', 'Role' : 'Course liason', 'Location' : 'Washington Avenue'},
                         {'Name' : 'James', 'Role' : 'Grader', 'Location' : 'Washington Avenue'}])

student_df = pd.DataFrame([{'Name' : 'James', 'School' : 'Business', 'Location' : '1024 Billiard Avenue'},
                           {'Name' : 'Mike', 'School' : 'Law', 'Location' : 'Fraternity House #22'},
                           {'Name' : 'Sally', 'School' : 'Engineering', 'Location' : '512 Wilson Crescent'}])

pd.merge(staff_df, student_df, how=  'left', on = 'Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally   Course liason  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

In [10]:
staff_df = pd.DataFrame([{'First Name' : 'Kelly', 'Last Name' : 'Desjardins', 'Role' : 'Director of HR'},
                         {'First Name' : 'Sally', 'Last Name' : 'Brooks', 'Role' : 'Course liason'},
                         {'First Name' : 'James', 'Last Name' : 'Wilde ', 'Role' : 'Grader'}])

student_df = pd.DataFrame([{'First Name' : 'James', 'Last Name' : 'Hammond', 'School' : 'Business'},
                           {'First Name' : 'Mike', 'Lsat Name' : 'Smith', 'School' : 'Law'},
                           {'First Name' : 'Sally', 'Last Name' : 'Brooks', 'School' : 'Engineering'}])

pd.merge(staff_df, student_df, how = 'inner', on = ['First Name', 'Last Name'])

  First Name Last Name           Role       School Lsat Name
0      Sally    Brooks  Course liason  Engineering       NaN

In [ ]:
 # pd.concat(frames, keys = ['2011', '2012', '2013])